In [24]:
import pymysql
import pandas as pd

In [25]:
_db = pymysql.connect(
    user = "root", # mysql 아이디
    passwd = "root", # mysql 비밀번호
    host ="localhost", # 내 컴퓨터
    db = "ubion"
)

In [26]:
cursor = _db.cursor(pymysql.cursors.DictCursor)

In [27]:
sql = "SELECT * FROM user_info"

cursor.execute(sql)
result = cursor.fetchall()
print(result)

[{'ID': 'cower', 'password': 'wer234', 'name': '신다혜', 'phone': '010-0269-2532', 'ads': 'Goyang', 'gender': 2, 'age': 24, 'regit_date': '2022-01-23'}, {'ID': 'cury', 'password': 'gwegw', 'name': '손흥민', 'phone': '010-0685-3572', 'ads': 'Seoul', 'gender': 1, 'age': 30, 'regit_date': '2022-01-15'}, {'ID': 'doory', 'password': 'sow', 'name': '이정환', 'phone': '010-0235-2342', 'ads': 'New York', 'gender': 1, 'age': 26, 'regit_date': '2022-01-23'}, {'ID': 'doosy', 'password': 'df23f', 'name': '장동민', 'phone': '010-0235-3342', 'ads': 'Busan', 'gender': 1, 'age': 26, 'regit_date': '2022-03-14'}, {'ID': 'kiks', 'password': 'wef23', 'name': '김진수', 'phone': '010-0255-2342', 'ads': 'Gangwon', 'gender': 2, 'age': 23, 'regit_date': '2022-03-14'}, {'ID': 'kim', 'password': '23g324', 'name': '김주영', 'phone': '010-3250-3523', 'ads': 'Istanbul', 'gender': 2, 'age': 32, 'regit_date': '2022-01-23'}, {'ID': 'test5', 'password': '32632', 'name': '또치', 'phone': '010-3235-3512', 'ads': 'Zoo', 'gender': 2, 'age': 17, 'regit_date': '2022-02-05'}]

In [28]:
dt= pd.DataFrame(result)

In [16]:
dt

      ID password name          phone       ads  gender  age  regit_date
0  cower   wer234  신다혜  010-0269-2532    Goyang       2   24  2022-01-23
1   cury    gwegw  손흥민  010-0685-3572     Seoul       1   30  2022-01-15
2  doory      sow  이정환  010-0235-2342  New York       1   26  2022-01-23
3  doosy    df23f  장동민  010-0235-3342     Busan       1   26  2022-03-14
4   kiks    wef23  김진수  010-0255-2342   Gangwon       2   23  2022-03-14
5    kim   23g324  김주영  010-3250-3523  Istanbul       2   32  2022-01-23
6  test5    32632   또치  010-3235-3512       Zoo       2   17  2022-02-05

In [29]:
sql = "insert into user_info values(%s, %s, %s, %s, %s, %s, %s, %s)" # %s만 있다.
values = ["test6", "32632", "또치", "010-3235-3512", "Zoo", 2, 17, "2022-02-05"]
cursor.execute(sql, values)
_db.commit()

In [30]:
sql = "insert into user_info values(%s, %s, %s, %s, %s, %s, %s, %s)"
_id = input("ID: ")
pw = input("password: ")
name = input("name: ")
phone = input("phone: ")
ads = input("address: ")
gender = int(input("gender: "))
age = int(input("age: "))
regit_date = input("regit_date: ")

input_list=[_id, pw, name, phone, ads, gender, age, regit_date]
cursor.execute(sql, input_list)
_db.commit()